7767517
173 210
Input            NN_input                 0 1 NN_input
Split            splitncnn_input0         1 2 NN_input NN_input_splitncnn_0 NN_input_splitncnn_1
ConvolutionDepthWise /net_distill/Conv        1 1 NN_input_splitncnn_1 /net_distill/Conv_output_0 0=12 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=48 7=3
BinaryOp         /net_distill/Div         1 1 /net_distill/Conv_output_0 /net_distill/Div_output_0 0=3 1=1 2=4.000000e+00
ShuffleChannel   /net_distill/Reshape_1   1 1 /net_distill/Div_output_0 /net_distill/Reshape_1_output_0 0=3 1=0
Convolution      /net_distill/layer01/main/main.0/Conv 1 1 /net_distill/Reshape_1_output_0 /net_distill/layer01/main/main.0/Conv_output_0 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
ReLU             /net_distill/layer01/main/main.1/LeakyRelu 1 1 /net_distill/layer01/main/main.0/Conv_output_0 /net_distill/layer01/main/main.1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer02/main/main.0/Conv 1 1 /net_distill/layer01/main/main.1/LeakyRelu_output_0 /net_distill/layer02/main/main.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
ReLU             /net_distill/layer02/main/main.1/LeakyRelu 1 1 /net_distill/layer02/main/main.0/Conv_output_0 /net_distill/layer02/main/main.1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer03/main/main.0/Conv 1 1 /net_distill/layer02/main/main.1/LeakyRelu_output_0 /net_distill/layer03/main/main.0/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             /net_distill/layer03/main/main.2/LeakyRelu 1 1 /net_distill/layer03/main/main.0/Conv_output_0 /net_distill/layer03/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_0              1 2 /net_distill/layer03/main/main.2/LeakyRelu_output_0 /net_distill/layer03/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/layer03/main/main.2/LeakyRelu_output_0_splitncnn_1
Convolution      /net_distill/layer04/main/main.0/Conv 1 1 /net_distill/layer03/main/main.2/LeakyRelu_output_0_splitncnn_1 /net_distill/layer04/main/main.0/Conv_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=98304
ReLU             /net_distill/layer04/main/main.2/LeakyRelu 1 1 /net_distill/layer04/main/main.0/Conv_output_0 /net_distill/layer04/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_1              1 3 /net_distill/layer04/main/main.2/LeakyRelu_output_0 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_1 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_2
Convolution      /net_distill/layer05/layer1/main/main.0/Conv 1 1 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_2 /net_distill/layer05/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer05/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer05/layer1/main/main.0/Conv_output_0 /net_distill/layer05/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer05/layer2/main/main.0/Conv 1 1 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_1 /net_distill/layer05/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer05/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer05/layer2/main/main.0/Conv_output_0 /net_distill/layer05/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer05/Concat 3 1 /net_distill/layer04/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/layer05/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer05/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer05/Concat_output_0 0=0
Convolution      /net_distill/layer05/fuse/Conv 1 1 /net_distill/layer05/Concat_output_0 /net_distill/layer05/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_2              1 3 /net_distill/layer05/fuse/Conv_output_0 /net_distill/layer05/fuse/Conv_output_0_splitncnn_0 /net_distill/layer05/fuse/Conv_output_0_splitncnn_1 /net_distill/layer05/fuse/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer06/layer1/main/main.0/Conv 1 1 /net_distill/layer05/fuse/Conv_output_0_splitncnn_2 /net_distill/layer06/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer06/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer06/layer1/main/main.0/Conv_output_0 /net_distill/layer06/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer06/layer2/main/main.0/Conv 1 1 /net_distill/layer05/fuse/Conv_output_0_splitncnn_1 /net_distill/layer06/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer06/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer06/layer2/main/main.0/Conv_output_0 /net_distill/layer06/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer06/Concat 3 1 /net_distill/layer05/fuse/Conv_output_0_splitncnn_0 /net_distill/layer06/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer06/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer06/Concat_output_0 0=0
Convolution      /net_distill/layer06/fuse/Conv 1 1 /net_distill/layer06/Concat_output_0 /net_distill/layer06/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_3              1 2 /net_distill/layer06/fuse/Conv_output_0 /net_distill/layer06/fuse/Conv_output_0_splitncnn_0 /net_distill/layer06/fuse/Conv_output_0_splitncnn_1
Convolution      /net_distill/layer07/main/main.0/Conv 1 1 /net_distill/layer06/fuse/Conv_output_0_splitncnn_1 /net_distill/layer07/main/main.0/Conv_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             /net_distill/layer07/main/main.2/LeakyRelu 1 1 /net_distill/layer07/main/main.0/Conv_output_0 /net_distill/layer07/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_4              1 3 /net_distill/layer07/main/main.2/LeakyRelu_output_0 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_1 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_2
Convolution      /net_distill/layer08/layer1/main/main.0/Conv 1 1 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_2 /net_distill/layer08/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer08/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer08/layer1/main/main.0/Conv_output_0 /net_distill/layer08/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer08/layer2/main/main.0/Conv 1 1 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_1 /net_distill/layer08/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer08/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer08/layer2/main/main.0/Conv_output_0 /net_distill/layer08/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer08/Concat 3 1 /net_distill/layer07/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/layer08/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer08/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer08/Concat_output_0 0=0
Convolution      /net_distill/layer08/fuse/Conv 1 1 /net_distill/layer08/Concat_output_0 /net_distill/layer08/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_5              1 3 /net_distill/layer08/fuse/Conv_output_0 /net_distill/layer08/fuse/Conv_output_0_splitncnn_0 /net_distill/layer08/fuse/Conv_output_0_splitncnn_1 /net_distill/layer08/fuse/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer09/layer1/main/main.0/Conv 1 1 /net_distill/layer08/fuse/Conv_output_0_splitncnn_2 /net_distill/layer09/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer09/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer09/layer1/main/main.0/Conv_output_0 /net_distill/layer09/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer09/layer2/main/main.0/Conv 1 1 /net_distill/layer08/fuse/Conv_output_0_splitncnn_1 /net_distill/layer09/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer09/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer09/layer2/main/main.0/Conv_output_0 /net_distill/layer09/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer09/Concat 3 1 /net_distill/layer08/fuse/Conv_output_0_splitncnn_0 /net_distill/layer09/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer09/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer09/Concat_output_0 0=0
Convolution      /net_distill/layer09/fuse/Conv 1 1 /net_distill/layer09/Concat_output_0 /net_distill/layer09/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_6              1 3 /net_distill/layer09/fuse/Conv_output_0 /net_distill/layer09/fuse/Conv_output_0_splitncnn_0 /net_distill/layer09/fuse/Conv_output_0_splitncnn_1 /net_distill/layer09/fuse/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer10/layer1/main/main.0/Conv 1 1 /net_distill/layer09/fuse/Conv_output_0_splitncnn_2 /net_distill/layer10/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer10/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer10/layer1/main/main.0/Conv_output_0 /net_distill/layer10/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer10/layer2/main/main.0/Conv 1 1 /net_distill/layer09/fuse/Conv_output_0_splitncnn_1 /net_distill/layer10/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer10/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer10/layer2/main/main.0/Conv_output_0 /net_distill/layer10/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer10/Concat 3 1 /net_distill/layer09/fuse/Conv_output_0_splitncnn_0 /net_distill/layer10/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer10/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer10/Concat_output_0 0=0
Convolution      /net_distill/layer10/fuse/Conv 1 1 /net_distill/layer10/Concat_output_0 /net_distill/layer10/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_7              1 3 /net_distill/layer10/fuse/Conv_output_0 /net_distill/layer10/fuse/Conv_output_0_splitncnn_0 /net_distill/layer10/fuse/Conv_output_0_splitncnn_1 /net_distill/layer10/fuse/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer11/layer1/main/main.0/Conv 1 1 /net_distill/layer10/fuse/Conv_output_0_splitncnn_2 /net_distill/layer11/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer11/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer11/layer1/main/main.0/Conv_output_0 /net_distill/layer11/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer11/layer2/main/main.0/Conv 1 1 /net_distill/layer10/fuse/Conv_output_0_splitncnn_1 /net_distill/layer11/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer11/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer11/layer2/main/main.0/Conv_output_0 /net_distill/layer11/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer11/Concat 3 1 /net_distill/layer10/fuse/Conv_output_0_splitncnn_0 /net_distill/layer11/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer11/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer11/Concat_output_0 0=0
Convolution      /net_distill/layer11/fuse/Conv 1 1 /net_distill/layer11/Concat_output_0 /net_distill/layer11/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Deconvolution    /net_distill/layer12/main/main.0/ConvTranspose 1 1 /net_distill/layer11/fuse/Conv_output_0 /net_distill/layer12/main/main.0/ConvTranspose_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
BatchNorm        /net_distill/layer12/main/main.1/BatchNormalization 1 1 /net_distill/layer12/main/main.0/ConvTranspose_output_0 /net_distill/layer12/main/main.1/BatchNormalization_output_0 0=96
ReLU             /net_distill/layer12/main/main.2/LeakyRelu 1 1 /net_distill/layer12/main/main.1/BatchNormalization_output_0 /net_distill/layer12/main/main.2/LeakyRelu_output_0 0=1.000000e-02
BinaryOp         /net_distill/Add         2 1 /net_distill/layer12/main/main.2/LeakyRelu_output_0 /net_distill/layer06/fuse/Conv_output_0_splitncnn_0 /net_distill/Add_output_0 0=0
Split            splitncnn_8              1 3 /net_distill/Add_output_0 /net_distill/Add_output_0_splitncnn_0 /net_distill/Add_output_0_splitncnn_1 /net_distill/Add_output_0_splitncnn_2
Convolution      /net_distill/layer13/layer1/main/main.0/Conv 1 1 /net_distill/Add_output_0_splitncnn_2 /net_distill/layer13/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer13/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer13/layer1/main/main.0/Conv_output_0 /net_distill/layer13/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer13/layer2/main/main.0/Conv 1 1 /net_distill/Add_output_0_splitncnn_1 /net_distill/layer13/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer13/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer13/layer2/main/main.0/Conv_output_0 /net_distill/layer13/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer13/Concat 3 1 /net_distill/Add_output_0_splitncnn_0 /net_distill/layer13/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer13/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer13/Concat_output_0 0=0
Convolution      /net_distill/layer13/fuse/Conv 1 1 /net_distill/layer13/Concat_output_0 /net_distill/layer13/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_9              1 3 /net_distill/layer13/fuse/Conv_output_0 /net_distill/layer13/fuse/Conv_output_0_splitncnn_0 /net_distill/layer13/fuse/Conv_output_0_splitncnn_1 /net_distill/layer13/fuse/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer14/layer1/main/main.0/Conv 1 1 /net_distill/layer13/fuse/Conv_output_0_splitncnn_2 /net_distill/layer14/layer1/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer14/layer1/main/main.2/LeakyRelu 1 1 /net_distill/layer14/layer1/main/main.0/Conv_output_0 /net_distill/layer14/layer1/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer14/layer2/main/main.0/Conv 1 1 /net_distill/layer13/fuse/Conv_output_0_splitncnn_1 /net_distill/layer14/layer2/main/main.0/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer14/layer2/main/main.2/LeakyRelu 1 1 /net_distill/layer14/layer2/main/main.0/Conv_output_0 /net_distill/layer14/layer2/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer14/Concat 3 1 /net_distill/layer13/fuse/Conv_output_0_splitncnn_0 /net_distill/layer14/layer1/main/main.2/LeakyRelu_output_0 /net_distill/layer14/layer2/main/main.2/LeakyRelu_output_0 /net_distill/layer14/Concat_output_0 0=0
Convolution      /net_distill/layer14/fuse/Conv 1 1 /net_distill/layer14/Concat_output_0 /net_distill/layer14/fuse/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Deconvolution    /net_distill/layer15/main/main.0/ConvTranspose 1 1 /net_distill/layer14/fuse/Conv_output_0 /net_distill/layer15/main/main.0/ConvTranspose_output_0 0=64 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=98304
BatchNorm        /net_distill/layer15/main/main.1/BatchNormalization 1 1 /net_distill/layer15/main/main.0/ConvTranspose_output_0 /net_distill/layer15/main/main.1/BatchNormalization_output_0 0=64
ReLU             /net_distill/layer15/main/main.2/LeakyRelu 1 1 /net_distill/layer15/main/main.1/BatchNormalization_output_0 /net_distill/layer15/main/main.2/LeakyRelu_output_0 0=1.000000e-02
BinaryOp         /net_distill/Add_1       2 1 /net_distill/layer15/main/main.2/LeakyRelu_output_0 /net_distill/layer03/main/main.2/LeakyRelu_output_0_splitncnn_0 /net_distill/Add_1_output_0 0=0
Convolution      /net_distill/layer16/main/main.0/Conv 1 1 /net_distill/Add_1_output_0 /net_distill/layer16/main/main.0/Conv_output_0 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
ReLU             /net_distill/layer16/main/main.2/LeakyRelu 1 1 /net_distill/layer16/main/main.0/Conv_output_0 /net_distill/layer16/main/main.2/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer17/Conv 1 1 /net_distill/layer16/main/main.2/LeakyRelu_output_0 /net_distill/layer17/Conv_output_0 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
UnaryOp          /net_distill/act_final/Tanh 1 1 /net_distill/layer17/Conv_output_0 /net_distill/act_final/Tanh_output_0 0=16
ConvolutionDepthWise /net_distill/Conv_1      1 1 /net_distill/act_final/Tanh_output_0 /net_distill/Conv_1_output_0 0=48 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=192 7=12
BinaryOp         /net_distill/Div_1       1 1 /net_distill/Conv_1_output_0 /net_distill/Div_1_output_0 0=3 1=1 2=4.000000e+00
ShuffleChannel   /net_distill/Reshape_3   1 1 /net_distill/Div_1_output_0 /net_distill/Reshape_3_output_0 0=12 1=0
Convolution      /net_distill/layer01/main/main.0_1/Conv 1 1 /net_distill/Reshape_3_output_0 /net_distill/layer01/main/main.0_1/Conv_output_0 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             /net_distill/layer01/main/main.1_1/LeakyRelu 1 1 /net_distill/layer01/main/main.0_1/Conv_output_0 /net_distill/layer01/main/main.1_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer02/main/main.0_1/Conv 1 1 /net_distill/layer01/main/main.1_1/LeakyRelu_output_0 /net_distill/layer02/main/main.0_1/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
ReLU             /net_distill/layer02/main/main.1_1/LeakyRelu 1 1 /net_distill/layer02/main/main.0_1/Conv_output_0 /net_distill/layer02/main/main.1_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer03/main/main.0_1/Conv 1 1 /net_distill/layer02/main/main.1_1/LeakyRelu_output_0 /net_distill/layer03/main/main.0_1/Conv_output_0 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             /net_distill/layer03/main/main.2_1/LeakyRelu 1 1 /net_distill/layer03/main/main.0_1/Conv_output_0 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_10             1 2 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0_splitncnn_1
Convolution      /net_distill/layer04/main/main.0_1/Conv 1 1 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0_splitncnn_1 /net_distill/layer04/main/main.0_1/Conv_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=98304
ReLU             /net_distill/layer04/main/main.2_1/LeakyRelu 1 1 /net_distill/layer04/main/main.0_1/Conv_output_0 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_11             1 3 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_1 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_2
Convolution      /net_distill/layer05/layer1/main/main.0_1/Conv 1 1 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_2 /net_distill/layer05/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer05/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer05/layer1/main/main.0_1/Conv_output_0 /net_distill/layer05/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer05/layer2/main/main.0_1/Conv 1 1 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_1 /net_distill/layer05/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer05/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer05/layer2/main/main.0_1/Conv_output_0 /net_distill/layer05/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer05_1/Concat 3 1 /net_distill/layer04/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/layer05/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer05/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer05_1/Concat_output_0 0=0
Convolution      /net_distill/layer05/fuse_1/Conv 1 1 /net_distill/layer05_1/Concat_output_0 /net_distill/layer05/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_12             1 3 /net_distill/layer05/fuse_1/Conv_output_0 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer06/layer1/main/main.0_1/Conv 1 1 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_2 /net_distill/layer06/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer06/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer06/layer1/main/main.0_1/Conv_output_0 /net_distill/layer06/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer06/layer2/main/main.0_1/Conv 1 1 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer06/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer06/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer06/layer2/main/main.0_1/Conv_output_0 /net_distill/layer06/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer06_1/Concat 3 1 /net_distill/layer05/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer06/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer06/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer06_1/Concat_output_0 0=0
Convolution      /net_distill/layer06/fuse_1/Conv 1 1 /net_distill/layer06_1/Concat_output_0 /net_distill/layer06/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_13             1 2 /net_distill/layer06/fuse_1/Conv_output_0 /net_distill/layer06/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer06/fuse_1/Conv_output_0_splitncnn_1
Convolution      /net_distill/layer07/main/main.0_1/Conv 1 1 /net_distill/layer06/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer07/main/main.0_1/Conv_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             /net_distill/layer07/main/main.2_1/LeakyRelu 1 1 /net_distill/layer07/main/main.0_1/Conv_output_0 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Split            splitncnn_14             1 3 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_1 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_2
Convolution      /net_distill/layer08/layer1/main/main.0_1/Conv 1 1 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_2 /net_distill/layer08/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer08/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer08/layer1/main/main.0_1/Conv_output_0 /net_distill/layer08/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer08/layer2/main/main.0_1/Conv 1 1 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_1 /net_distill/layer08/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer08/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer08/layer2/main/main.0_1/Conv_output_0 /net_distill/layer08/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer08_1/Concat 3 1 /net_distill/layer07/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/layer08/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer08/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer08_1/Concat_output_0 0=0
Convolution      /net_distill/layer08/fuse_1/Conv 1 1 /net_distill/layer08_1/Concat_output_0 /net_distill/layer08/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_15             1 3 /net_distill/layer08/fuse_1/Conv_output_0 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer09/layer1/main/main.0_1/Conv 1 1 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_2 /net_distill/layer09/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer09/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer09/layer1/main/main.0_1/Conv_output_0 /net_distill/layer09/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer09/layer2/main/main.0_1/Conv 1 1 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer09/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer09/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer09/layer2/main/main.0_1/Conv_output_0 /net_distill/layer09/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer09_1/Concat 3 1 /net_distill/layer08/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer09/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer09/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer09_1/Concat_output_0 0=0
Convolution      /net_distill/layer09/fuse_1/Conv 1 1 /net_distill/layer09_1/Concat_output_0 /net_distill/layer09/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_16             1 3 /net_distill/layer09/fuse_1/Conv_output_0 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer10/layer1/main/main.0_1/Conv 1 1 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_2 /net_distill/layer10/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer10/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer10/layer1/main/main.0_1/Conv_output_0 /net_distill/layer10/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer10/layer2/main/main.0_1/Conv 1 1 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer10/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer10/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer10/layer2/main/main.0_1/Conv_output_0 /net_distill/layer10/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer10_1/Concat 3 1 /net_distill/layer09/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer10/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer10/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer10_1/Concat_output_0 0=0
Convolution      /net_distill/layer10/fuse_1/Conv 1 1 /net_distill/layer10_1/Concat_output_0 /net_distill/layer10/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_17             1 3 /net_distill/layer10/fuse_1/Conv_output_0 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer11/layer1/main/main.0_1/Conv 1 1 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_2 /net_distill/layer11/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer11/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer11/layer1/main/main.0_1/Conv_output_0 /net_distill/layer11/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer11/layer2/main/main.0_1/Conv 1 1 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer11/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer11/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer11/layer2/main/main.0_1/Conv_output_0 /net_distill/layer11/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer11_1/Concat 3 1 /net_distill/layer10/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer11/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer11/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer11_1/Concat_output_0 0=0
Convolution      /net_distill/layer11/fuse_1/Conv 1 1 /net_distill/layer11_1/Concat_output_0 /net_distill/layer11/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Deconvolution    /net_distill/layer12/main/main.0_1/ConvTranspose 1 1 /net_distill/layer11/fuse_1/Conv_output_0 /net_distill/layer12/main/main.0_1/ConvTranspose_output_0 0=96 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
BatchNorm        /net_distill/layer12/main/main.1_1/BatchNormalization 1 1 /net_distill/layer12/main/main.0_1/ConvTranspose_output_0 /net_distill/layer12/main/main.1_1/BatchNormalization_output_0 0=96
ReLU             /net_distill/layer12/main/main.2_1/LeakyRelu 1 1 /net_distill/layer12/main/main.1_1/BatchNormalization_output_0 /net_distill/layer12/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
BinaryOp         /net_distill/Add_2       2 1 /net_distill/layer12/main/main.2_1/LeakyRelu_output_0 /net_distill/layer06/fuse_1/Conv_output_0_splitncnn_0 /net_distill/Add_2_output_0 0=0
Split            splitncnn_18             1 3 /net_distill/Add_2_output_0 /net_distill/Add_2_output_0_splitncnn_0 /net_distill/Add_2_output_0_splitncnn_1 /net_distill/Add_2_output_0_splitncnn_2
Convolution      /net_distill/layer13/layer1/main/main.0_1/Conv 1 1 /net_distill/Add_2_output_0_splitncnn_2 /net_distill/layer13/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer13/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer13/layer1/main/main.0_1/Conv_output_0 /net_distill/layer13/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer13/layer2/main/main.0_1/Conv 1 1 /net_distill/Add_2_output_0_splitncnn_1 /net_distill/layer13/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer13/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer13/layer2/main/main.0_1/Conv_output_0 /net_distill/layer13/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer13_1/Concat 3 1 /net_distill/Add_2_output_0_splitncnn_0 /net_distill/layer13/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer13/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer13_1/Concat_output_0 0=0
Convolution      /net_distill/layer13/fuse_1/Conv 1 1 /net_distill/layer13_1/Concat_output_0 /net_distill/layer13/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Split            splitncnn_19             1 3 /net_distill/layer13/fuse_1/Conv_output_0 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_2
Convolution      /net_distill/layer14/layer1/main/main.0_1/Conv 1 1 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_2 /net_distill/layer14/layer1/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer14/layer1/main/main.2_1/LeakyRelu 1 1 /net_distill/layer14/layer1/main/main.0_1/Conv_output_0 /net_distill/layer14/layer1/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer14/layer2/main/main.0_1/Conv 1 1 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_1 /net_distill/layer14/layer2/main/main.0_1/Conv_output_0 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=82944
ReLU             /net_distill/layer14/layer2/main/main.2_1/LeakyRelu 1 1 /net_distill/layer14/layer2/main/main.0_1/Conv_output_0 /net_distill/layer14/layer2/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Concat           /net_distill/layer14_1/Concat 3 1 /net_distill/layer13/fuse_1/Conv_output_0_splitncnn_0 /net_distill/layer14/layer1/main/main.2_1/LeakyRelu_output_0 /net_distill/layer14/layer2/main/main.2_1/LeakyRelu_output_0 /net_distill/layer14_1/Concat_output_0 0=0
Convolution      /net_distill/layer14/fuse_1/Conv 1 1 /net_distill/layer14_1/Concat_output_0 /net_distill/layer14/fuse_1/Conv_output_0 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=27648
Deconvolution    /net_distill/layer15/main/main.0_1/ConvTranspose 1 1 /net_distill/layer14/fuse_1/Conv_output_0 /net_distill/layer15/main/main.0_1/ConvTranspose_output_0 0=64 1=4 11=4 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=98304
BatchNorm        /net_distill/layer15/main/main.1_1/BatchNormalization 1 1 /net_distill/layer15/main/main.0_1/ConvTranspose_output_0 /net_distill/layer15/main/main.1_1/BatchNormalization_output_0 0=64
ReLU             /net_distill/layer15/main/main.2_1/LeakyRelu 1 1 /net_distill/layer15/main/main.1_1/BatchNormalization_output_0 /net_distill/layer15/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
BinaryOp         /net_distill/Add_3       2 1 /net_distill/layer15/main/main.2_1/LeakyRelu_output_0 /net_distill/layer03/main/main.2_1/LeakyRelu_output_0_splitncnn_0 /net_distill/Add_3_output_0 0=0
Convolution      /net_distill/layer16/main/main.0_1/Conv 1 1 /net_distill/Add_3_output_0 /net_distill/layer16/main/main.0_1/Conv_output_0 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
ReLU             /net_distill/layer16/main/main.2_1/LeakyRelu 1 1 /net_distill/layer16/main/main.0_1/Conv_output_0 /net_distill/layer16/main/main.2_1/LeakyRelu_output_0 0=1.000000e-02
Convolution      /net_distill/layer17_1/Conv 1 1 /net_distill/layer16/main/main.2_1/LeakyRelu_output_0 /net_distill/layer17_1/Conv_output_0 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
UnaryOp          /net_distill/act_final_1/Tanh 1 1 /net_distill/layer17_1/Conv_output_0 /net_distill/act_final_1/Tanh_output_0 0=16
Convolution      /net_distill/Conv_2      1 1 /net_distill/act_final_1/Tanh_output_0 /net_distill/Conv_2_output_0 0=3 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
UnaryOp          /net_distill/Tanh        1 1 /net_distill/Conv_2_output_0 /net_distill/Tanh_output_0 0=16
ConvolutionDepthWise /down_op/main/Conv       1 1 NN_input_splitncnn_0 /down_op/main/Conv_output_0 0=3 1=4 11=4 2=1 12=1 3=4 13=4 4=0 14=0 15=0 16=0 5=0 6=48 7=3
BinaryOp         /Add                     2 1 /net_distill/Tanh_output_0 /down_op/main/Conv_output_0 /Add_output_0 0=0
Clip             /Clip                    1 1 /Add_output_0 NN_output 0=-1.000000e+00 1=1.000000e+00
